Varcain/Contiki/platform/stm32f4discovery/contiki-main.c
#include <contiki.h>
#include <contiki-net.h>

#include <stdio.h>
#include <stddef.h>
#include <stm32f4xx.h>

#include <dev/leds.h>
#include <dev/uart1.h>
#include <dev/uart3.h>
#include <dev/slip.h>

#include <shell.h>

#include "stm32f4xx_dbgmcu.h"

#define DEBUG 1
#if DEBUG
#include <stdio.h>
#define PRINTF(...) printf(__VA_ARGS__)
#else
#define PRINTF(...)
#endif

uip_ipaddr_t hostaddr,netmask, draddr;

static struct uip_fw_netif slipif =
{UIP_FW_NETIF(172,16,0,0, 255,255,0,0, slip_send)};

#undef putchar

int __attribute__(( weak )) putchar(int c)
{
  uart1_writeb(c);
  return c;
}

void __io_putchar(char c)
{
  putchar(c);
}


/*---------------------------------------------------------------------------*/
int
main(void)
{
	//DBGMCU_Config(DBGMCU_SLEEP | DBGMCU_STOP | DBGMCU_STANDBY, ENABLE);

	uart3_init(0);
	uart1_init(0);
	slip_arch_init(0);
	leds_init();
	printf("\rStarting Contiki on STM32F4 Discovery...\n\r");

	clock_init();
	process_init();

	//serial_line_init();
	//uart1_set_input(serial_line_input_byte);

	uip_init();
	uip_fw_init();
	process_start(&tcpip_process, NULL);
	process_start(&slip_process, NULL);
	process_start(&uip_fw_process, NULL);

	uip_ipaddr(&hostaddr, 172, 16, 0, 1);
	uip_sethostaddr(&hostaddr);
	uip_ipaddr(&netmask, 255, 255, 0, 0);
	uip_setnetmask(&netmask);
	uip_ipaddr(&netmask, 172, 16, 0, 2);
	uip_setdraddr(&draddr);
	uip_fw_register(&slipif);
	uip_fw_default(&slipif);

	process_start(&etimer_process, NULL);
	ctimer_init();

	autostart_start(autostart_processes);

	while (1)
	{
		process_run();
	}

	return 0;
}
/*---------------------------------------------------------------------------*/
void
log_message(char *m1, char *m2)
{
	printf("%s%s\n", m1, m2);
}
/*---------------------------------------------------------------------------*/
void
uip_log(char *m)
{
	printf("%s\n", m);
}
/*---------------------------------------------------------------------------*/
